app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
	def index
		#checar que solo mande las imagenes
		@upload = Upload.all

INSERT INTO "uploads" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@upload = Upload.create(upload_params)

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "uploads" WHERE "uploads"."id" = ?  [["id", 13]]
---
  def destroy
  	@upload = Upload.find(params[:id])
  	if @upload.destroy